Перем ирМобильный Экспорт;
Перем ирОбщий Экспорт;
Перем ирСервер Экспорт;
Перем ирКэш Экспорт;
Перем ирПривилегированный Экспорт;

#Если Клиент Тогда	
Перем мПараметры Экспорт;
	
// Инициализирует экземпляр класса.
//
// Параметры:
//  *СтруктураЭкземляров - Структура, *Неопределено - содержит все объекты данного класса для данной формы;
//  пФорма       - Форма - владелец элементов управления;
//  пПолеТекстовогоДокумента – ПолеТекстовогоДокумента;
//  пКоманднаяПанель – КоманднаяПанель – в конце которой будут размещены кнопки;
//
Процедура Инициализировать(пФорма, пФормула, пМетодВыполнения = "", пКонтекстВыполнения = Неопределено,
	Параметры = Неопределено, Описание = Неопределено) Экспорт

	Формула = пФормула;
	КонтекстВыполнения = пКонтекстВыполнения;
	МетодВыполнения = пМетодВыполнения;
	
	Если КонтекстВыполнения = Неопределено Тогда
		КонтекстВыполнения = ЭтотОбъект;
	КонецЕсли;
	Если МетодВыполнения = "" Тогда
		МетодВыполнения = "ВыполнитьЛокально";
	КонецЕсли;
	Попытка
		Выполнить("КонтекстВыполнения." + МетодВыполнения + "(""Неопределено"")");
	Исключение
		//Сообщить(ОписаниеОшибки(), СтатусСообщения.Информация);
		//Сообщить("Задан неверный контекст выполнения программы. Будет использован чистый контекст выполнения", СтатусСообщения.Информация);
		КонтекстВыполнения = ЭтотОбъект;
		МетодВыполнения = "ВычислитьЛокально";
	КонецПопытки;
	ЭтотОбъект.мПараметры = Параметры;
	Если Описание <> Неопределено Тогда
		ЭтотОбъект.Описание = Описание;
	КонецЕсли; 
	
КонецПроцедуры // Инициализировать()

// Освобождает ресурсы занятые экземпляром класса.
// Самое главное - очистить ссылки на формы и объекты БД.
//
// Параметры:
//  Нет.
//
Процедура Уничтожить() Экспорт

	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		ЭтотОбъект[Реквизит.Имя] = Неопределено;
	КонецЦикла;

КонецПроцедуры // Уничтожить()

// Вычисляет программный код локально.
//
// Параметры:
//  ТекстДляВычисления – Строка.
//
Функция ВычислитьЛокально(ТекстДляВычисления) Экспорт
	
	лПараметры = мПараметры; // Устаревшее
	Параметры = мПараметры;
	Возврат Вычислить(ТекстДляВычисления);

КонецФункции // ВычислитьЛока()

#Если Клиент Тогда
Контейнер = Новый Структура();
Оповестить("ирПолучитьБазовуюФорму", Контейнер);
Если Не Контейнер.Свойство("ирМобильный", ирМобильный) Тогда
	ПолноеИмяФайлаБазовогоМодуля = ВосстановитьЗначение("ирПолноеИмяФайлаОсновногоМодуля");
	ирМобильный = ВнешниеОбработки.ПолучитьФорму(ПолноеИмяФайлаБазовогоМодуля);
КонецЕсли; 
ирОбщий = ирМобильный.ПолучитьОбщийМодульЛкс("ирОбщий");
ирКэш = ирМобильный.ПолучитьОбщийМодульЛкс("ирКэш");
ирСервер = ирМобильный.ПолучитьОбщийМодульЛкс("ирСервер");
ирПривилегированный = ирМобильный.ПолучитьОбщийМодульЛкс("ирПривилегированный");
#КонецЕсли

Описание = "Здесь задается выражение для вычисления на встроенном языке. Для обращения к значениям параметров служит переменная Параметры.";
#КонецЕсли
