
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Элементы.Справочник.КнопкаВыпадающегоСписка = Истина;
		Элементы.Регистр.КнопкаВыпадающегоСписка = Истина;
		Элементы.ТабличнаяЧасть.КнопкаВыпадающегоСписка = Истина
	КонецЕсли;
	
	Элементы.ВидДобавляемойНастройки.Видимость = Элементы.ВидДобавляемойНастройки.СписокВыбора.Количество() > 1
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураДанных = Новый Структура("Источник, ДобавляемаяНастройка", "ФормаДобавленияДополнительнойНастройки", ПолучитьСтруктуруДобавляемыхНастроек());
	ОповеститьОВыборе(СтруктураДанных);	
		
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ВидДобавляемойНастройкиПриИзменении(Элемент)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страницы.ПодчиненныеЭлементы[ВидДобавляемойНастройки]
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Функция ПолучитьСтруктуруДобавляемыхНастроек()
	
	СтруктураДобавляемыхНастроек = Новый Структура("Настройка, Представление, ЭтоРегистр, ЗагружаетсяДоОбъекта, РежимЗагрузки", "", "", Ложь, Ложь, 0);
	
	Если ВидДобавляемойНастройки = 0 Тогда
		СтруктураДобавляемыхНастроек.РежимЗагрузки = 0;
		СтруктураДобавляемыхНастроек.Настройка = Справочник;
		СтруктураДобавляемыхНастроек.Представление = Элементы.Справочник.ТекстРедактирования;
		СтруктураДобавляемыхНастроек.ЗагружаетсяДоОбъекта = Истина;
	ИначеЕсли ВидДобавляемойНастройки = 1 Тогда
		СтруктураДобавляемыхНастроек.РежимЗагрузки = 5;
		СтруктураДобавляемыхНастроек.Настройка = ТабличнаяЧасть;
		СтруктураДобавляемыхНастроек.Представление = Элементы.ТабличнаяЧасть.ТекстРедактирования;
	ИначеЕсли ВидДобавляемойНастройки = 2 Тогда
		СтруктураДобавляемыхНастроек.РежимЗагрузки = 3;
		СтруктураДобавляемыхНастроек.Настройка = Регистр;
		СтруктураДобавляемыхНастроек.Представление = Элементы.Регистр.ТекстРедактирования;
		СтруктураДобавляемыхНастроек.ЭтоРегистр = Истина;
	КонецЕсли;
	
	Возврат СтруктураДобавляемыхНастроек
	
КонецФункции
