
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СисИнфо = Новый СистемнаяИнформация;
	Если Лев(СисИнфо.ВерсияПриложения, 3) = "8.3" Тогда
		Элементы.ЗначениеПоУмолчанию.КнопкаВыпадающегоСписка = Истина;
		Элементы.НастройкаЗагрузки.КнопкаВыпадающегоСписка = Истина
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОповеститьОВыборе(Новый Структура("Источник, ЗначениеПоУмолчанию, НастройкаЗагрузки, ЗаголовокНастройкиЗагрузки", "ФормаВыбораЗначенияПоУмолчанию", ЗначениеПоУмолчанию, НастройкаЗагрузки, Элементы.НастройкаЗагрузки.ТекстРедактирования))
	
КонецПроцедуры


