
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "Нажатие" в: Кнопка "ОК"
//
Процедура ОКНажатие(Команда)
	
	ОповеститьОВыборе(Новый Структура("Источник, СписокНастроек", "ФормаВосстановленияНастроек", Элементы.СписокНастроек.ТекущиеДанные))
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие" в: Кнопка "Отмена"
//
Процедура ОтменаНажатие(Команда)
	Закрыть()
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "Нажатие" в: Кнопка "Удалить"
//
Процедура УдалитьНажатие(Команда)
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда		
		УдалитьНастройку(ТекущиеДанные.Представление);		
		Если НЕ ТекущиеДанные.КартинкаСтроки = 1 Тогда
			Оповестить("УдаленаНастройка", ТекущиеДанные.Представление);
			СписокНастроек.Удалить(ТекущиеДанные)
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
// Процедура - обработчик изменения настройки по умолчанию
//
Процедура СписокНастроекПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;
	Оповестить("УстановленаНастройкаПоУмолчанию", Новый Структура("Представление, Пометка", ТекущиеДанные.Представление, ТекущиеДанные.Пометка));
	Если ТекущиеДанные.Пометка Тогда
		Для каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь
			КонецЕсли
		КонецЦикла
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
// Обработчик выбора настройки
//
Процедура СписокНастроекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(Новый Структура("Источник, СписокНастроек", "ФормаВосстановленияНастроек", Элементы.СписокНастроек.ТекущиеДанные))
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура удаляет настройку из Хранилища настроек форм
//
Процедура УдалитьНастройку(Представление)
	
	ХранилищеНастроекДанныхФорм.Удалить(ИдентификаторОбработки, "Настройки:" + Представление, Неопределено)
	
КонецПроцедуры
